Repository: eugeneai/bash-essentials-ru-handbok
Catalog: tmx/en-ru-level2.tmx
Source language: en
Languages: ru

source: You can now run your simple script from the command line by typing the name of it.
ru: Теперь можно запускать свой скрипт из командной строки, указав его имя.

source: You can run less in two ways:
ru: Существует два способа использования less:

source: You can scroll through the top output using the up, down, left, and right keys.
ru: Можно прокручивать текст, выдаваемый программой, с помощью клавиш вверх, вниз, влево и вправо.

source: You can see all the signals by typing kill -l, but here are the most common signals that you might send to a process:
ru: Перечень всех сигналов выводится в результате команды kill -l. Вот наиболее распространенные сигналы, часто отправляемые в процесс:

source: You can see the public information about a given domain.
ru: Получена информация о заданном доменном имени.

source: You can specify any path to place it on your remote machine so long as you put a colon : after the IP address.
ru: Можно указать любое месторасположение размещения файлов на удаленном компьютере. Оно указывается после :, которое после IP-адреса.

source: You can think of a character class as a single character, but with multiple possibilities.
ru: Классы символов можно вопринимать как просто символ, но имеющий множество возможностей.

source: You can think of grep as the “search” tool built-in to the command line.
ru: Grep можно воспринимать как инструмент поиска, встроенный в командную строку.

source: You can toggle this on and off using the letter d.
ru: Переключение режима отображения осуществляется буквой d.

source: You can use this as long as the shell is still open.
ru: Ее можно использовать пока оболочка все еще открыта.

source: You could also use ';'.
ru: Можно просто использовать ';'.

source: You could always write out a long and elaborate command and execute it, but it will not get saved and is difficult to write.
ru: В принципе, всегда можно набить длинную и сложную команду в строке и выполнить ее, но она не будет сохранена, а набивать ее каждый раз совсем неудобно.

source: You may find this useful if you need to do something on a periodic basis.
ru: Сценарии полезны при решении повторяющихся задач.

source: You may have never thought this would happen, but the post is finally over.
ru: Трудно в это поверить, но данный пост автор таки закончил.

source: You may have to Google for help regarding specific use cases, but you will never have any confusion about regular expressions.
ru: Поиск Google дает результаты для конкретных случаяев использования.

source: You may not have this installed by default, so you can type sudo apt-get install whois to install it.
ru: Она наверняка не установлена по умолчанию, поэтому выполнив sudo apt-get install whois, можно установить ее.

source: You might be wondering what the '{}' and \; pieces of this command mean.
ru: Навеное интересно, что такое '{}' и \;, что это за элементы, использованные в команде.

source: You might be wondering why you would ever need something like [0-9] when you could just use \d, and you are wondering for good reason!
ru: Тепер те, кто пользовался [0-9] могут смело переходит на использование \d!

source: You now need to print out and copy the public version of this key.
ru: Теперь нужно вывести на экран и скопировать в буфер обмена открытую часть ключа.

source: You will notice that when you try to do anything in the Chrome window, it will not work because it is a stopped process.
ru: Заметим, когда вы пытаетесь сделать что-либо в окне Chrome, он не работает, потому что он - приостановленный процесс.

source: You would need to use the find command when you want to search for certain files within the entire filesystem.
ru: Программа поиска необходима, если вы хотите искать файлы с определенными свойствами во всей файловой системе.

source: Your Computer’s Wireless Card
ru: Беспроводная карта компьютера

source: Your ISP assigns your network an IP address and a subnet mask.
ru: Ваш интернет-провайдер назначает вашей сети IP-адрес и маску подсети.

source: Your home network and the internet
ru: Сеть в доме и доступ в Интернет

source: Zach Gollwitzer
ru: Зак Голлвитцер

source: [3] contains their detailed survey.
ru: [3] содержит его подробный обзор.

source: adaptation of existing logical inference approaches to support resource-driven games and corresponding data structures and operations over them.
ru: адаптация существующих подходов к построению автоматических логических выводов к поддержке ресурсно-управляемых игр при помощи соответствующих структур данных и операций над ними.

source: and Control theory of Siberian Branch
ru: Сибирского отделения

source: awk and sed
ru: Утилиты awk и sed

source: development of declarative means of complex DES description in aspects of: event occurrence, state change, resource consumption/production and acquiring, competitor behavior, functioning constraints, as well as computer simulation parameter definition;
ru: разработки декларативных средств комплексного описания ДСС по аспектам моделирования возникновения событий, изменения состояния, потребления/создания и блокировки ресурсови, конкурентного поведения, функциональных ограничений, а также задания параметров имитационного моделирования;

source: development of methods for building supervisors for RDDESU by means of logical inference, utilizing its descriptive means and generally modified strategies.
ru: разработка методов построения супервайзеров для РУДССН при помощи логического вывода, используя его дескриптивные средства и модифицированные стратегии.

source: development of the technique for representing near-to-the-real manufacturing processes as RDDESU and adaptation of the existing methods of the advanced control of manufacturing process to the RDDESU.
ru: разработка методики для представления производственных процессов, приближенных реальным, в виде РУДССН как RDDESU и адаптация существующих методов упреждающего управления (advanced conrol) технологическими процессами в RDDESU.

source: devising a software for DES description and its computer simulation, supporting generation and evaluation of various scenarios, visualization and assessment of the results.
ru: разработка программного обеспечения для описания ДСС и их имиттационного моделирования с поддержкой порождения и оценки различных сценариев, визуализации и оценки результатов.

source: devising approaches to visual definition of part of the declarative model with standard modelling notation, e.g., UML, SysML, BPMN, CMMN, etc.
ru: разработка подходов к визуальному задания части декларативной спецификации при помощи стандартных языков визуального моделирования, например, UML, SysML, BPMN, CMMN и т.д.

source: dig/host/whois
ru: Программы dig/host/whois

source: filter.seqs removes columns from alignments based on a criteria defined by the user.
ru: Команда ```filter.seqs``` удаляет столбцы (части прочтений) из выравниваний на основе критериев, определенных пользователем.

source: find <directory to search> [options] <file name to search>
ru: find <директорий, где производить поиск> [флаги] <имя файла, который ищем>

source: find and exec
ru: Команды find и exec

source: for loops
ru: Циклы "for"

source: free, time
ru: Команды free и time

source: grep [all your options] "text to search for" <file-to-search-in>
ru: grep [все опции и ключи здесь] "текст, который ищется" <имя-файла-где-ищем>

source: if-then statements
ru: Оператор "if-then"

source: ifconfig
ru: Утилита ifconfig

source: lsof
ru: Программ lsof

source: netstat
ru: Программа netstat

source: of Russian Academy of Sciences
ru: Российской Академии наук

source: of Siberian Branch
ru: Сибирского отделения

source: omitted for brevity ....
ru: пропущено для краткости ....

source: ping
ru: Программа ping

source: ps and top commands (system performance management)
ru: Команды ps и top (управление общей производительностью системы)

source: specialization and testing the methods and software under development in the field of manufacturing control.
ru: специализация, отработка методов и программного обеспечения в области управления производством.

source: stock data over the last 3 months called aapl.csv.
ru: данные по акциям за последние 3 месяца, файл AAPL.csv.

source: summary
ru: Содержание

source: tar, gzip, gunzip
ru: Команды tar, gzip, gunzip

source: traceroute
ru: Программа traceroute

source: { } [ ] \ | ( )) will all behave differently when placed inside brackets, and furthermore, you can write an adequate regular expression without them 99% of the time!
ru: { } [ ] \ | ( )) меняют свое поведение, если их поместить в квадратные скобки, более того, можно создавать регулярные выражения без выражений в 99% случаев!

source: Направление из Стратегии научно-технологического развития Российской Федерации (при наличии) (выбор из справочника) / The direction of the Strategy of scientific-technical development of Russian Federation (if applicable) (chosen from a standard catalog)
ru: +++ Направление из научно-технологического Стратегии развития Российской Федерации (при наличии) (выбор из справочника) / направление Стратегии научно-технического развития Российской Федерации (если применимо) (выбирается из стандартного каталога)

source: “bob879@yahoo.com.yahoo.com“ is obviously an invalid email and we do not want to match it.
ru: “bob879@yahoo.com.yahoo.com“ - очевидно неправильный электронный адрем, надо выкинуть его из результата.
